Repository: Danleb/OptimalFuzzyPartition
Catalog: OptimalFuzzyPartition/Resources/Resource.*.resx
Languages: ru_ru, uk_ua

# WindowTitleSettings
source: Settings for the fuzzy partitioning algorithm
ru_ru: Настройки алгоритма построения нечеткого разбиения
uk_ua: Налаштування алгоритму побудови нечіткого розбиття

# MenuNew
source: New
ru_ru: Новый
uk_ua: Новий

# MenuAbout
source: About
ru_ru: О программе
uk_ua: Про програму

# WindowTitleCreation
source: Fuzzy partition generation
ru_ru: Построение нечёткого разбиения
uk_ua: Побудова нечіткого розбиття

# WindowTitleAbout
source: About
ru_ru: О программе
uk_ua: Про програму

# MenuConfiguration
source: Configuration
ru_ru: Конфигурация
uk_ua: Налаштування

# MenuLanguage
source: Language
ru_ru: Язык
uk_ua: Мова

# MenuTheme
source: Theme
ru_ru: Тема
uk_ua: Тема

source: Enter max X:
ru_ru: Введите максимальную границу X:
uk_ua: Введіть більшу границю за X:

source: Enter max Y:
ru_ru: Введите максимальную границу Y:
uk_ua: Введіть більшу границю за Y:

source: Enter min X:
ru_ru: Введите минимальную границу X:
uk_ua: Введіть меншу границю за X:

source: Enter min Y:
ru_ru: Введите минимальную границу Y:
uk_ua: Введіть меншу границю за Y:

# SpaceSettings
source: Partition space settings:
ru_ru: Настройки пространства, на котором будет проводиться разбиение:
uk_ua: Налаштування простору, на якому буде проводитись розбиття:

# EnterSegmentsX
source: Enter X dimension segments count:
ru_ru: Введите количество сегментов сетки по X:
uk_ua: Введіть кількість сегментів сітки за X:

# EnterSegmentsY
source: Enter Y dimension segments count:
ru_ru: Введите количество сегментов сетки по Y:
uk_ua: Введіть кількість сегментів сітки за Y:

source: Centers count
ru_ru: Количество центров
uk_ua: Кількість центрів

# DensityFunction
source: Density function ρ(x, y):
ru_ru: Функция плотности (потребления) ρ(x, y):
uk_ua: Функція щільності попиту ρ(x, y):

# TaskWithCentersPlacing
source: Task with optimal centers placing
ru_ru: Задача с размещением центров
uk_ua: Задача із оптимальним розміщенням центрів

# DistanceFunction
source: Metrics distance function с((x,y), τ):
ru_ru: Функция расстояния с((x,y), τ):
uk_ua: Функція відстані с((x,y), τ):

source: Centers coordinates:
ru_ru: Координаты центров (точек-генераторов):
uk_ua: Координати центрів (точок-генераторів):

source: Center number
ru_ru: Номер центра
uk_ua: Номер центру

source: Build partition
ru_ru: Построить разбиение
uk_ua: Побудувати розбиття

# AdditiveCoefficient
source: Additive coefficient A
ru_ru: Аддитивный коэффициент A
uk_ua: Адитивний коефіцієнт А

source: Coordinate X
ru_ru: Координата Х
uk_ua: Координата Х

source: Coordinate Y
ru_ru: Координата Y
uk_ua: Координата Y

# MultiplicativeCoefficient
source: Multiplicative coefficient W
ru_ru: Мультипликативный коэффициент W
uk_ua: Мультиплікативний коефіцієнт W

# SquareIntegrationSettings
source: Area integration settings:
ru_ru: Настройки интегрирования площади:
uk_ua: Налаштування інтегрування площі:

# GaussLegendreCoefCount
source: Number of Gauss-Legendre coefficients for integration:
ru_ru: Количество коэффициентов Гаусса-Лежандра для расчёта интеграла:
uk_ua: Кількість коефіцієнтів Гауса-Лежадра для рахування інтеграла:

# FixedFuzzyPartitionSettings
source: Settings for calculating fuzzy partition with fixed centers:
ru_ru: Настройки расчёта нечеткого разбиения с закреплёнными центрами:
uk_ua: Налаштування нечіткого розбиття з закріпленими центрами:

source: Max iterations count:
ru_ru: Максимальное количество итераций:
uk_ua: Максимальна кількість ітерацій:

# MinimalGradientValueIterationsStop
source: Minimal gradient length for iterations stop:
ru_ru: Минимальная длина градиента для окончания итераций:
uk_ua: Мінімальне граничне значення градієнту для закінчення ітерацій:

source: Start Psi value:
ru_ru: Начальное значение Psi:
uk_ua: Початкове значення Psi (впливає на швидкість збігу методу):

# GradientStepConstant
source: Constant C for gradient step calculation λ = C / (k + 1):
ru_ru: Константа С для расчёта шага градиента λ = C / (k + 1):
uk_ua: Константа C для кроку градієнтного спуску λ = C / (k + 1):

# StepIncreaseCoef
source: Step increase coefficient:
ru_ru: Коэффициент увеличения шага:
uk_ua: Коефіцієнт збільшення кроку:

# StepDecreaseCoef
source: Step decrease coefficient:
ru_ru: Коэффициент уменьшения шага:
uk_ua: Коефіцієнт зменшення кроку:

# SpaceStretchCoef
source: Space stretch coefficient:
ru_ru: Коэффициент растяжения пространства:
uk_ua: Коефіцієнт розтягу простору:

source: Iterations count to increase step:
ru_ru: Количество итераций для увеличения шага:
uk_ua: Кількість ітерацій до збільшення кроку:

source: Gradient descent start step:
ru_ru: Начальный шаг градиентного спуска:
uk_ua: Початковий крок градієнтного спуску:

# CentersPlacingSettings
source: Settings for fuzzy partition with centers placing:
ru_ru: Настройки разбиения с размещением центров:
uk_ua: Налаштування розбиття з розміщенням цетрів:

# MinCenterDiffToStop
source: Minimal distance between center coordinates to continue:
ru_ru: Минимальный шаг сдвига центров для продолжения итераций:
uk_ua: Мінімальний крок зсуву центрів для продовження:

# ThemeDark
source: Dark
ru_ru: Тёмная
uk_ua: Темна

# ThemeLight
source: Light
ru_ru: Светлая
uk_ua: Світла

# LicenseInfo
source: Licensed under MIT license.
ru_ru: Лицензия MIT.
uk_ua: Ліцензія MIT.

# CopyrightInfo
source: Copyright © Danylo Lebediev 2020-2022.
ru_ru: Копирайт © Данила Лебедев 2020-2022.
uk_ua: Копірайт © Данило Лебедєв 2020-2022.

source: Version
ru_ru: Версия
uk_ua: Версія

# ProgramInfo
source: Program for fuzzy partitions generation with fixed and placing centers.
ru_ru: Программа для построения нечётких разбиений с фиксированными центрами и с размещением.
uk_ua: Програма для побудови нечітких розбиттів з фіксованими центрами та оптимальним розміщенням центрів.

source: Site:
ru_ru: Сайт:
uk_ua: Сайт:

source: Always show centers info
ru_ru: Всегда показывать информацию о центрах
uk_ua: Завжди показувати інформацію про центри

# DrawWithMistrustCoef
source: Draw with mistrust coefficient
ru_ru: Рисовать разбиение с коэффициентом недоверия
uk_ua: Малювати розбиття з коефіцієнтом недовіри

source: Dual functional value:
ru_ru: Значение двойственного функционала:
uk_ua: Значення двоїстого функціоналу:

# GrayscaleImage
source: Draw grayscale
ru_ru: Изображение в градациях серого
uk_ua: Зображення у градаціях сірого

# MistrustsCoefficient
source: Mistrust coefficient:
ru_ru: Коэффициент недоверия:
uk_ua: Коефіцієнт недовіри:

source: Path:
ru_ru: Путь:
uk_ua: Шлях:

source: Save image
ru_ru: Сохранить изображение
uk_ua: Зберегти зображення

source: Select path
ru_ru: Выбрать путь
uk_ua: Обрати шлях

source: Select path manually
ru_ru: Выбрать путь вручную
uk_ua: Обрати шлях вручну

source: Target functional value:
ru_ru: Значение целевого функционала:
uk_ua: Значення цільового функціоналу:

# UpdatePartition
source: Update partition image
ru_ru: Обновить изображение разбиения
uk_ua: Оновити розбиття

source: Time passed:
ru_ru: Времени прошло:
uk_ua: Часу пройшло:

source: Performed iterations count:
ru_ru: Итераций выполнено:
uk_ua: Ітерацій виконано:

source: Everywhere 1
ru_ru: Везде 1
uk_ua: Всюди 1

source: Custom distance function
ru_ru: Произвольно заданная функция расстояния
uk_ua: Довільно вказана функція відстані

source: Chebishev metric
ru_ru: Метрика Чебышева
uk_ua: Метрика Чебишева

source: Euclidean metric
ru_ru: Эвклидовая метрика
uk_ua: Евклідова метрика

source: Manhattan metric
ru_ru: Манхэттенская метрика
uk_ua: Манхеттенська метрика

source: Centers settings:
ru_ru: Настройки центров (точек-генераторов):
uk_ua: Налаштування центрів (точок-генераторів):
